## Анализ набора данных с использованием `pandas` (2)

In [2]:
import pandas as pd
import numpy as np
df = pd.read_csv('Employee.csv')

In [3]:
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

In [4]:
df.groupby('EverBenched')['LeaveOrNot'].mean()*100

EverBenched
No     33.125749
Yes    45.397490
Name: LeaveOrNot, dtype: float64

Постройте сводную таблицу, показывающую средний возраст сотрудников в каждом городе.

In [5]:
df.pivot_table(values='Age', index='City')

                 Age
City
Bangalore  29.594255
New Delhi  29.121003
Pune       29.288644

Рассчитайте количество сотрудников по каждому уровню образования и их средний возраст.

In [6]:
df.pivot_table(values="Age", index="Education", aggfunc=['count', 'mean'])

          count       mean
            Age        Age
Education
Bachelors  3601  29.422938
Masters     873  29.290951
PHD         179  29.296089

Создайте сводную таблицу, показывающую количество мужчин и женщин в каждом уровне оплаты (Payment Tier).

In [10]:
# df.pivot_table(index='PaymentTier', columns='Gender', aggfunc='size', fill_value=0)
df.pivot_table(values = 'Age',index = ['PaymentTier','Gender'],aggfunc = ('count'))

                     Age
PaymentTier Gender
1           Female   131
            Male     112
2           Female   605
            Male     313
3           Female  1139
            Male    2353

Составьте сводную таблицу, отражающую процент сотрудников, покинувших компанию в следующие два года, в зависимости от того, были ли они когда-либо исключены из проектов на месяц или более.

In [11]:
leave_percent_by_benched = df.groupby('EverBenched')['LeaveOrNot'].mean() * 100

print("Процент сотрудников, покинувших компанию в следующие два года, в зависимости от исключения из проектов:")
print(leave_percent_by_benched)

Процент сотрудников, покинувших компанию в следующие два года, в зависимости от исключения из проектов:
EverBenched
No     33.125749
Yes    45.397490
Name: LeaveOrNot, dtype: float64

Постройте сводную таблицу, отображающую медианный опыт работы в текущей области в зависимости от уровня образования и пола сотрудников.

In [12]:
df.pivot_table(values = 'ExperienceInCurrentDomain',index = ['Education'],columns = ['Gender'],aggfunc = ('median'))

Gender     Female  Male
Education
Bachelors       3     3
Masters         2     3
PHD             3     3

Рассчитайте количество сотрудников по каждому году присоединения к компании и их средний возраст.

In [13]:
df.pivot_table(values='Age', index='JoiningYear', aggfunc=['count', 'mean'])

            count       mean
              Age        Age
JoiningYear
2012          504  29.603175
2013          669  29.008969
2014          699  29.290415
2015          781  29.476312
2016          525  29.552381
2017         1108  29.416968
2018          367  29.525886

Создайте сводную таблицу, показывающую процент сотрудников, покинувших компанию в следующие два года, в зависимости от уровня образования и города, в котором они работают.

In [15]:
leave_percent_by_benched = df.groupby(['Education', 'City'])['LeaveOrNot'].mean() * 100
leave_percent_by_benched

Education  City
Bachelors  Bangalore    24.025341
           New Delhi    18.063315
           Pune         53.260870
Masters    Bangalore    70.161290
           New Delhi    47.001934
           Pune         41.379310
PHD        Bangalore    28.846154
           New Delhi    25.242718
           Pune         16.666667
Name: LeaveOrNot, dtype: float64

In [16]:
df.pivot_table(values='LeaveOrNot', index='Education',columns='City')

City       Bangalore  New Delhi      Pune
Education
Bachelors   0.240253   0.180633  0.532609
Masters     0.701613   0.470019  0.413793
PHD         0.288462   0.252427  0.166667

Составьте сводную таблицу, отображающую средний возраст сотрудников, которые были когда-либо исключены из проектов, и тех, кто не был, в зависимости от уровня оплаты.

In [17]:
df.pivot_table(values='Age', index='EverBenched', columns='PaymentTier')

PaymentTier          1          2          3
EverBenched
No           29.644444  29.204848  29.460160
Yes          28.944444  28.989247  29.217984

Постройте сводную таблицу, показывающую средний возраст сотрудников, которые покинули компанию в следующие два года, в зависимости от города и опыта работы в текущей области.

In [22]:
df[df['LeaveOrNot']==1].pivot_table(values='Age', index='City', columns='ExperienceInCurrentDomain', fill_value='-')

ExperienceInCurrentDomain,0,1,2,3,4,5,6,7
City,,,,,,,,
Bangalore,30.822222,30.975309,29.413793,28.669492,28.115789,28.905660,38.5,39.0
New Delhi,30.000000,30.090909,29.724771,27.552239,27.472973,27.984375,-,-
Pune,31.833333,31.283784,28.406897,28.359649,27.898438,28.728814,-,-

Создайте сводную таблицу, отображающую процент сотрудников, покинувших компанию в следующие два года, в зависимости от уровня оплаты и того, были ли они когда-либо исключены из проектов на месяц или более.

In [23]:
df.pivot_table(values='LeaveOrNot',index='PaymentTier',columns='EverBenched')

EverBenched        No       Yes
PaymentTier
1            0.355556  0.500000
2            0.575758  0.806452
3            0.264960  0.362398